{"class_name": "Sequential", "keras_version": "1.2.0", "config": [{"class_name": "Lambda", "config": {"input_dtype": "float32", "output_shape_type": "raw", "name": "lambda_1", "function_type": "lambda", "trainable": true, "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000S\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003N\u00e9\u00ff\u0000\u0000\u0000g\u0000\u0000\u0000\u0000\u0000\u0000\u00e0?\u00a9\u0000)\u0001\u00da\u0001xr\u0002\u0000\u0000\u0000r\u0002\u0000\u0000\u0000\u00faE/home/dario/Dropbox/selfdriving/source/p3_behavioral_cloning/model.py\u00da\b<lambda>6\u0000\u0000\u0000\u00f3\u0000\u0000\u0000\u0000", null, null], "arguments": {}, "batch_input_shape": [null, 90, 320, 3], "output_shape": null}}, {"class_name": "Convolution2D", "config": {"nb_row": 5, "nb_filter": 24, "nb_col": 5, "b_constraint": null, "activation": "linear", "bias": true, "name": "convolution2d_1", "init": "glorot_uniform", "subsample": [1, 1], "border_mode": "valid", "b_regularizer": null, "W_constraint": null, "activity_regularizer": null, "trainable": true, "dim_ordering": "tf", "W_regularizer": null}}, {"class_name": "Activation", "config": {"name": "activation_1", "activation": "relu", "trainable": true}}, {"class_name": "MaxPooling2D", "config": {"dim_ordering": "tf", "name": "maxpooling2d_1", "strides": [2, 2], "border_mode": "valid", "trainable": true, "pool_size": [2, 2]}}, {"class_name": "Convolution2D", "config": {"nb_row": 5, "nb_filter": 36, "nb_col": 5, "b_constraint": null, "activation": "linear", "bias": true, "name": "convolution2d_2", "init": "glorot_uniform", "subsample": [1, 1], "border_mode": "valid", "b_regularizer": null, "W_constraint": null, "activity_regularizer": null, "trainable": true, "dim_ordering": "tf", "W_regularizer": null}}, {"class_name": "Activation", "config": {"name": "activation_2", "activation": "relu", "trainable": true}}, {"class_name": "MaxPooling2D", "config": {"dim_ordering": "tf", "name": "maxpooling2d_2", "strides": [2, 2], "border_mode": "valid", "trainable": true, "pool_size": [2, 2]}}, {"class_name": "Convolution2D", "config": {"nb_row": 5, "nb_filter": 48, "nb_col": 5, "b_constraint": null, "activation": "linear", "bias": true, "name": "convolution2d_3", "init": "glorot_uniform", "subsample": [1, 1], "border_mode": "valid", "b_regularizer": null, "W_constraint": null, "activity_regularizer": null, "trainable": true, "dim_ordering": "tf", "W_regularizer": null}}, {"class_name": "Activation", "config": {"name": "activation_3", "activation": "relu", "trainable": true}}, {"class_name": "MaxPooling2D", "config": {"dim_ordering": "tf", "name": "maxpooling2d_3", "strides": [2, 2], "border_mode": "valid", "trainable": true, "pool_size": [2, 2]}}, {"class_name": "Convolution2D", "config": {"nb_row": 3, "nb_filter": 64, "nb_col": 3, "b_constraint": null, "activation": "linear", "bias": true, "name": "convolution2d_4", "init": "glorot_uniform", "subsample": [1, 1], "border_mode": "valid", "b_regularizer": null, "W_constraint": null, "activity_regularizer": null, "trainable": true, "dim_ordering": "tf", "W_regularizer": null}}, {"class_name": "Activation", "config": {"name": "activation_4", "activation": "relu", "trainable": true}}, {"class_name": "Convolution2D", "config": {"nb_row": 3, "nb_filter": 64, "nb_col": 3, "b_constraint": null, "activation": "linear", "bias": true, "name": "convolution2d_5", "init": "glorot_uniform", "subsample": [1, 1], "border_mode": "valid", "b_regularizer": null, "W_constraint": null, "activity_regularizer": null, "trainable": true, "dim_ordering": "tf", "W_regularizer": null}}, {"class_name": "Activation", "config": {"name": "activation_5", "activation": "relu", "trainable": true}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "trainable": true, "p": 0.2}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"b_constraint": null, "input_dim": 6144, "output_dim": 1164, "batch_input_shape": [null, 6144], "input_dtype": "float32", "bias": true, "name": "dense_1", "init": "glorot_uniform", "trainable": true, "b_regularizer": null, "W_constraint": null, "activity_regularizer": null, "activation": "linear", "W_regularizer": null}}, {"class_name": "Activation", "config": {"name": "activation_6", "activation": "relu", "trainable": true}}, {"class_name": "Dense", "config": {"b_constraint": null, "input_dim": 1164, "output_dim": 100, "batch_input_shape": [null, 1164], "input_dtype": "float32", "bias": true, "name": "dense_2", "init": "glorot_uniform", "trainable": true, "b_regularizer": null, "W_constraint": null, "activity_regularizer": null, "activation": "linear", "W_regularizer": null}}, {"class_name": "Activation", "config": {"name": "activation_7", "activation": "relu", "trainable": true}}, {"class_name": "Dense", "config": {"b_constraint": null, "input_dim": 100, "output_dim": 50, "batch_input_shape": [null, 100], "input_dtype": "float32", "bias": true, "name": "dense_3", "init": "glorot_uniform", "trainable": true, "b_regularizer": null, "W_constraint": null, "activity_regularizer": null, "activation": "linear", "W_regularizer": null}}, {"class_name": "Activation", "config": {"name": "activation_8", "activation": "relu", "trainable": true}}, {"class_name": "Dense", "config": {"b_constraint": null, "input_dim": 50, "output_dim": 10, "batch_input_shape": [null, 50], "input_dtype": "float32", "bias": true, "name": "dense_4", "init": "glorot_uniform", "trainable": true, "b_regularizer": null, "W_constraint": null, "activity_regularizer": null, "activation": "linear", "W_regularizer": null}}, {"class_name": "Activation", "config": {"name": "activation_9", "activation": "relu", "trainable": true}}, {"class_name": "Dense", "config": {"b_constraint": null, "input_dim": 10, "output_dim": 1, "batch_input_shape": [null, 10], "input_dtype": "float32", "bias": true, "name": "dense_5", "init": "glorot_uniform", "trainable": true, "b_regularizer": null, "W_constraint": null, "activity_regularizer": null, "activation": "linear", "W_regularizer": null}}]}