{"config": [{"config": {"nb_row": 5, "input_dtype": "float32", "activation": "linear", "W_regularizer": null, "b_regularizer": null, "W_constraint": null, "init": "glorot_uniform", "activity_regularizer": null, "b_constraint": null, "trainable": true, "name": "convolution2d_1", "nb_col": 5, "batch_input_shape": [null, 90, 320, 3], "border_mode": "valid", "subsample": [1, 1], "nb_filter": 24, "bias": true, "dim_ordering": "tf"}, "class_name": "Convolution2D"}, {"config": {"name": "activation_1", "activation": "relu", "trainable": true}, "class_name": "Activation"}, {"config": {"trainable": true, "pool_size": [2, 2], "border_mode": "valid", "name": "maxpooling2d_1", "dim_ordering": "tf", "strides": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"nb_row": 5, "activation": "linear", "W_regularizer": null, "init": "glorot_uniform", "W_constraint": null, "b_regularizer": null, "activity_regularizer": null, "b_constraint": null, "trainable": true, "nb_col": 5, "name": "convolution2d_2", "border_mode": "valid", "subsample": [1, 1], "nb_filter": 36, "bias": true, "dim_ordering": "tf"}, "class_name": "Convolution2D"}, {"config": {"name": "activation_2", "activation": "relu", "trainable": true}, "class_name": "Activation"}, {"config": {"trainable": true, "pool_size": [2, 2], "border_mode": "valid", "name": "maxpooling2d_2", "dim_ordering": "tf", "strides": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"nb_row": 5, "activation": "linear", "W_regularizer": null, "init": "glorot_uniform", "W_constraint": null, "b_regularizer": null, "activity_regularizer": null, "b_constraint": null, "trainable": true, "nb_col": 5, "name": "convolution2d_3", "border_mode": "valid", "subsample": [1, 1], "nb_filter": 48, "bias": true, "dim_ordering": "tf"}, "class_name": "Convolution2D"}, {"config": {"name": "activation_3", "activation": "relu", "trainable": true}, "class_name": "Activation"}, {"config": {"trainable": true, "pool_size": [2, 2], "border_mode": "valid", "name": "maxpooling2d_3", "dim_ordering": "tf", "strides": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"nb_row": 3, "activation": "linear", "W_regularizer": null, "init": "glorot_uniform", "W_constraint": null, "b_regularizer": null, "activity_regularizer": null, "b_constraint": null, "trainable": true, "nb_col": 3, "name": "convolution2d_4", "border_mode": "valid", "subsample": [1, 1], "nb_filter": 64, "bias": true, "dim_ordering": "tf"}, "class_name": "Convolution2D"}, {"config": {"name": "activation_4", "activation": "relu", "trainable": true}, "class_name": "Activation"}, {"config": {"nb_row": 3, "activation": "linear", "W_regularizer": null, "init": "glorot_uniform", "W_constraint": null, "b_regularizer": null, "activity_regularizer": null, "b_constraint": null, "trainable": true, "nb_col": 3, "name": "convolution2d_5", "border_mode": "valid", "subsample": [1, 1], "nb_filter": 64, "bias": true, "dim_ordering": "tf"}, "class_name": "Convolution2D"}, {"config": {"name": "activation_5", "activation": "relu", "trainable": true}, "class_name": "Activation"}, {"config": {"name": "dropout_1", "trainable": true, "p": 0.2}, "class_name": "Dropout"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"input_dim": 6144, "activation": "linear", "W_regularizer": null, "output_dim": 1164, "batch_input_shape": [null, 6144], "init": "glorot_uniform", "activity_regularizer": null, "trainable": true, "b_constraint": null, "b_regularizer": null, "W_constraint": null, "name": "dense_1", "input_dtype": "float32", "bias": true}, "class_name": "Dense"}, {"config": {"name": "activation_6", "activation": "relu", "trainable": true}, "class_name": "Activation"}, {"config": {"input_dim": 1164, "activation": "linear", "W_regularizer": null, "output_dim": 100, "batch_input_shape": [null, 1164], "init": "glorot_uniform", "activity_regularizer": null, "trainable": true, "b_constraint": null, "b_regularizer": null, "W_constraint": null, "name": "dense_2", "input_dtype": "float32", "bias": true}, "class_name": "Dense"}, {"config": {"name": "activation_7", "activation": "relu", "trainable": true}, "class_name": "Activation"}, {"config": {"input_dim": 100, "activation": "linear", "W_regularizer": null, "output_dim": 50, "batch_input_shape": [null, 100], "init": "glorot_uniform", "activity_regularizer": null, "trainable": true, "b_constraint": null, "b_regularizer": null, "W_constraint": null, "name": "dense_3", "input_dtype": "float32", "bias": true}, "class_name": "Dense"}, {"config": {"name": "activation_8", "activation": "relu", "trainable": true}, "class_name": "Activation"}, {"config": {"input_dim": 50, "activation": "linear", "W_regularizer": null, "output_dim": 10, "batch_input_shape": [null, 50], "init": "glorot_uniform", "activity_regularizer": null, "trainable": true, "b_constraint": null, "b_regularizer": null, "W_constraint": null, "name": "dense_4", "input_dtype": "float32", "bias": true}, "class_name": "Dense"}, {"config": {"name": "activation_9", "activation": "relu", "trainable": true}, "class_name": "Activation"}, {"config": {"input_dim": 10, "activation": "linear", "W_regularizer": null, "output_dim": 1, "batch_input_shape": [null, 10], "init": "glorot_uniform", "activity_regularizer": null, "trainable": true, "b_constraint": null, "b_regularizer": null, "W_constraint": null, "name": "dense_5", "input_dtype": "float32", "bias": true}, "class_name": "Dense"}], "class_name": "Sequential", "keras_version": "1.2.0"}