{"keras_version": "1.2.0", "class_name": "Sequential", "config": [{"class_name": "Convolution2D", "config": {"subsample": [1, 1], "activity_regularizer": null, "dim_ordering": "tf", "b_regularizer": null, "W_constraint": null, "input_dtype": "float32", "nb_row": 5, "nb_filter": 24, "init": "glorot_uniform", "name": "convolution2d_1", "bias": true, "activation": "linear", "nb_col": 5, "W_regularizer": null, "batch_input_shape": [null, 90, 320, 3], "trainable": true, "border_mode": "valid", "b_constraint": null}}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_1", "trainable": true}}, {"class_name": "MaxPooling2D", "config": {"name": "maxpooling2d_1", "pool_size": [2, 2], "dim_ordering": "tf", "border_mode": "valid", "trainable": true, "strides": [2, 2]}}, {"class_name": "Convolution2D", "config": {"subsample": [1, 1], "activity_regularizer": null, "dim_ordering": "tf", "b_regularizer": null, "W_constraint": null, "b_constraint": null, "activation": "linear", "nb_filter": 36, "init": "glorot_uniform", "name": "convolution2d_2", "bias": true, "W_regularizer": null, "nb_row": 5, "nb_col": 5, "trainable": true, "border_mode": "valid"}}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_2", "trainable": true}}, {"class_name": "MaxPooling2D", "config": {"name": "maxpooling2d_2", "pool_size": [2, 2], "dim_ordering": "tf", "border_mode": "valid", "trainable": true, "strides": [2, 2]}}, {"class_name": "Convolution2D", "config": {"subsample": [1, 1], "activity_regularizer": null, "dim_ordering": "tf", "b_regularizer": null, "W_constraint": null, "b_constraint": null, "activation": "linear", "nb_filter": 48, "init": "glorot_uniform", "name": "convolution2d_3", "bias": true, "W_regularizer": null, "nb_row": 5, "nb_col": 5, "trainable": true, "border_mode": "valid"}}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_3", "trainable": true}}, {"class_name": "MaxPooling2D", "config": {"name": "maxpooling2d_3", "pool_size": [2, 2], "dim_ordering": "tf", "border_mode": "valid", "trainable": true, "strides": [2, 2]}}, {"class_name": "Convolution2D", "config": {"subsample": [1, 1], "activity_regularizer": null, "dim_ordering": "tf", "b_regularizer": null, "W_constraint": null, "b_constraint": null, "activation": "linear", "nb_filter": 64, "init": "glorot_uniform", "name": "convolution2d_4", "bias": true, "W_regularizer": null, "nb_row": 3, "nb_col": 3, "trainable": true, "border_mode": "valid"}}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_4", "trainable": true}}, {"class_name": "Convolution2D", "config": {"subsample": [1, 1], "activity_regularizer": null, "dim_ordering": "tf", "b_regularizer": null, "W_constraint": null, "b_constraint": null, "activation": "linear", "nb_filter": 64, "init": "glorot_uniform", "name": "convolution2d_5", "bias": true, "W_regularizer": null, "nb_row": 3, "nb_col": 3, "trainable": true, "border_mode": "valid"}}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_5", "trainable": true}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "trainable": true, "p": 0.2}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"bias": true, "b_regularizer": null, "W_constraint": null, "b_constraint": null, "activation": "linear", "init": "glorot_uniform", "name": "dense_1", "activity_regularizer": null, "input_dim": 6144, "W_regularizer": null, "trainable": true, "output_dim": 1164}}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_6", "trainable": true}}, {"class_name": "Dense", "config": {"bias": true, "b_regularizer": null, "W_constraint": null, "b_constraint": null, "activation": "linear", "init": "glorot_uniform", "name": "dense_2", "activity_regularizer": null, "input_dim": 1164, "W_regularizer": null, "trainable": true, "output_dim": 100}}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_7", "trainable": true}}, {"class_name": "Dense", "config": {"bias": true, "b_regularizer": null, "W_constraint": null, "b_constraint": null, "activation": "linear", "init": "glorot_uniform", "name": "dense_3", "activity_regularizer": null, "input_dim": 100, "W_regularizer": null, "trainable": true, "output_dim": 50}}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_8", "trainable": true}}, {"class_name": "Dense", "config": {"bias": true, "b_regularizer": null, "W_constraint": null, "b_constraint": null, "activation": "linear", "init": "glorot_uniform", "name": "dense_4", "activity_regularizer": null, "input_dim": 50, "W_regularizer": null, "trainable": true, "output_dim": 10}}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_9", "trainable": true}}, {"class_name": "Dense", "config": {"bias": true, "b_regularizer": null, "W_constraint": null, "b_constraint": null, "activation": "linear", "init": "glorot_uniform", "name": "dense_5", "activity_regularizer": null, "input_dim": 10, "W_regularizer": null, "trainable": true, "output_dim": 1}}]}