{"class_name": "Sequential", "keras_version": "1.2.0", "config": [{"class_name": "Lambda", "config": {"name": "lambda_1", "trainable": true, "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000S\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003N\u00e9\u00ff\u0000\u0000\u0000g\u0000\u0000\u0000\u0000\u0000\u0000\u00e0?\u00a9\u0000)\u0001\u00da\u0001xr\u0002\u0000\u0000\u0000r\u0002\u0000\u0000\u0000\u00faE/home/dario/Dropbox/selfdriving/source/p3_behavioral_cloning/model.py\u00da\b<lambda>6\u0000\u0000\u0000\u00f3\u0000\u0000\u0000\u0000", null, null], "arguments": {}, "function_type": "lambda", "output_shape_type": "raw", "output_shape": null, "batch_input_shape": [null, 90, 320, 3], "input_dtype": "float32"}}, {"class_name": "Convolution2D", "config": {"name": "convolution2d_1", "trainable": true, "nb_col": 5, "nb_row": 5, "activity_regularizer": null, "W_constraint": null, "activation": "linear", "b_regularizer": null, "b_constraint": null, "dim_ordering": "tf", "init": "glorot_uniform", "nb_filter": 24, "bias": true, "border_mode": "valid", "subsample": [1, 1], "W_regularizer": null}}, {"class_name": "Activation", "config": {"name": "activation_1", "trainable": true, "activation": "relu"}}, {"class_name": "MaxPooling2D", "config": {"name": "maxpooling2d_1", "trainable": true, "strides": [2, 2], "dim_ordering": "tf", "pool_size": [2, 2], "border_mode": "valid"}}, {"class_name": "Convolution2D", "config": {"name": "convolution2d_2", "trainable": true, "nb_col": 5, "nb_row": 5, "activity_regularizer": null, "W_constraint": null, "activation": "linear", "b_regularizer": null, "b_constraint": null, "dim_ordering": "tf", "init": "glorot_uniform", "nb_filter": 36, "bias": true, "border_mode": "valid", "subsample": [1, 1], "W_regularizer": null}}, {"class_name": "Activation", "config": {"name": "activation_2", "trainable": true, "activation": "relu"}}, {"class_name": "MaxPooling2D", "config": {"name": "maxpooling2d_2", "trainable": true, "strides": [2, 2], "dim_ordering": "tf", "pool_size": [2, 2], "border_mode": "valid"}}, {"class_name": "Convolution2D", "config": {"name": "convolution2d_3", "trainable": true, "nb_col": 5, "nb_row": 5, "activity_regularizer": null, "W_constraint": null, "activation": "linear", "b_regularizer": null, "b_constraint": null, "dim_ordering": "tf", "init": "glorot_uniform", "nb_filter": 48, "bias": true, "border_mode": "valid", "subsample": [1, 1], "W_regularizer": null}}, {"class_name": "Activation", "config": {"name": "activation_3", "trainable": true, "activation": "relu"}}, {"class_name": "MaxPooling2D", "config": {"name": "maxpooling2d_3", "trainable": true, "strides": [2, 2], "dim_ordering": "tf", "pool_size": [2, 2], "border_mode": "valid"}}, {"class_name": "Convolution2D", "config": {"name": "convolution2d_4", "trainable": true, "nb_col": 3, "nb_row": 3, "activity_regularizer": null, "W_constraint": null, "activation": "linear", "b_regularizer": null, "b_constraint": null, "dim_ordering": "tf", "init": "glorot_uniform", "nb_filter": 64, "bias": true, "border_mode": "valid", "subsample": [1, 1], "W_regularizer": null}}, {"class_name": "Activation", "config": {"name": "activation_4", "trainable": true, "activation": "relu"}}, {"class_name": "Convolution2D", "config": {"name": "convolution2d_5", "trainable": true, "nb_col": 3, "nb_row": 3, "activity_regularizer": null, "W_constraint": null, "activation": "linear", "b_regularizer": null, "b_constraint": null, "dim_ordering": "tf", "init": "glorot_uniform", "nb_filter": 64, "bias": true, "border_mode": "valid", "subsample": [1, 1], "W_regularizer": null}}, {"class_name": "Activation", "config": {"name": "activation_5", "trainable": true, "activation": "relu"}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "trainable": true, "p": 0.2}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"name": "dense_1", "trainable": true, "bias": true, "activity_regularizer": null, "W_constraint": null, "activation": "linear", "b_regularizer": null, "b_constraint": null, "init": "glorot_uniform", "input_dim": 6144, "output_dim": 1164, "batch_input_shape": [null, 6144], "input_dtype": "float32", "W_regularizer": null}}, {"class_name": "Activation", "config": {"name": "activation_6", "trainable": true, "activation": "relu"}}, {"class_name": "Dense", "config": {"name": "dense_2", "trainable": true, "bias": true, "activity_regularizer": null, "W_constraint": null, "activation": "linear", "b_regularizer": null, "b_constraint": null, "init": "glorot_uniform", "input_dim": 1164, "output_dim": 100, "batch_input_shape": [null, 1164], "input_dtype": "float32", "W_regularizer": null}}, {"class_name": "Activation", "config": {"name": "activation_7", "trainable": true, "activation": "relu"}}, {"class_name": "Dense", "config": {"name": "dense_3", "trainable": true, "bias": true, "activity_regularizer": null, "W_constraint": null, "activation": "linear", "b_regularizer": null, "b_constraint": null, "init": "glorot_uniform", "input_dim": 100, "output_dim": 50, "batch_input_shape": [null, 100], "input_dtype": "float32", "W_regularizer": null}}, {"class_name": "Activation", "config": {"name": "activation_8", "trainable": true, "activation": "relu"}}, {"class_name": "Dense", "config": {"name": "dense_4", "trainable": true, "bias": true, "activity_regularizer": null, "W_constraint": null, "activation": "linear", "b_regularizer": null, "b_constraint": null, "init": "glorot_uniform", "input_dim": 50, "output_dim": 10, "batch_input_shape": [null, 50], "input_dtype": "float32", "W_regularizer": null}}, {"class_name": "Activation", "config": {"name": "activation_9", "trainable": true, "activation": "relu"}}, {"class_name": "Dense", "config": {"name": "dense_5", "trainable": true, "bias": true, "activity_regularizer": null, "W_constraint": null, "activation": "linear", "b_regularizer": null, "b_constraint": null, "init": "glorot_uniform", "input_dim": 10, "output_dim": 1, "batch_input_shape": [null, 10], "input_dtype": "float32", "W_regularizer": null}}]}